# Data Types (Series, Data Frame) , Importing and Exporting Data (csv files)

In [1]:
import pandas as pd

Two types of data types in pandas 
*Series 1-dimension
*Data Frame 2-Dimension

In [2]:
#series 
#it take list
cars = pd.Series(["Honda","Toyota","Nissan"])
cars

0     Honda
1    Toyota
2    Nissan
dtype: object

In [3]:
colours = pd.Series(["Red","Green","black"])
colours

0      Red
1    Green
2    black
dtype: object

In [4]:
# Date Frame
#it take dictionaries

car_data = pd.DataFrame({"Company" : cars, "Color" : colours})
car_data

  Company  Color
0   Honda    Red
1  Toyota  Green
2  Nissan  black

In [5]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [6]:
car_sales.to_csv("exported-car-sales.csv", index=False)

In [7]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describe Data

In [8]:
# Attribute
car_sales.dtypes

#Fucntion
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [9]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [10]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [12]:
# works in only numerical value (int etc )
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [13]:
 car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
Make             10 non-null object
Colour           10 non-null object
Odometer (KM)    10 non-null int64
Doors            10 non-null int64
Price            10 non-null object
dtypes: int64(2), object(3)
memory usage: 480.0+ bytes

In [14]:
car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [16]:
# also apply mean on inidividual series like
car_prizes = pd.Series([5000,3000,23232])
car_prizes.mean()

10410.666666666666

In [17]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [18]:
car_sales["Doors"].sum()

40

In [20]:
car_sales["Doors"].mean()

4.0

In [21]:
len(car_sales)

10

In [22]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [23]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [25]:
#numpy representation of data 
car_sales.to_numpy()

array([['Toyota', 'White', 150043, 4, '$4,000.00'],
       ['Honda', 'Red', 87899, 4, '$5,000.00'],
       ['Toyota', 'Blue', 32549, 3, '$7,000.00'],
       ['BMW', 'Black', 11179, 5, '$22,000.00'],
       ['Nissan', 'White', 213095, 4, '$3,500.00'],
       ['Toyota', 'Green', 99213, 4, '$4,500.00'],
       ['Honda', 'Blue', 45698, 4, '$7,500.00'],
       ['Honda', 'Blue', 54738, 4, '$7,000.00'],
       ['Toyota', 'White', 60000, 4, '$6,250.00'],
       ['Nissan', 'White', 31600, 4, '$9,700.00']], dtype=object)

In [26]:
#transposing data
car_sales.T

,0,1,2,3,4,5,6,7,8,9
Make,Toyota,Honda,Toyota,BMW,Nissan,Toyota,Honda,Honda,Toyota,Nissan
Colour,White,Red,Blue,Black,White,Green,Blue,Blue,White,White
Odometer (KM),150043,87899,32549,11179,213095,99213,45698,54738,60000,31600
Doors,4,4,3,5,4,4,4,4,4,4
Price,"$4,000.00","$5,000.00","$7,000.00","$22,000.00","$3,500.00","$4,500.00","$7,500.00","$7,000.00","$6,250.00","$9,700.00"

In [29]:
#sorting data by axis
car_sales.sort_index(axis=1, ascending=False)

        Price  Odometer (KM)    Make  Doors Colour
0   $4,000.00         150043  Toyota      4  White
1   $5,000.00          87899   Honda      4    Red
2   $7,000.00          32549  Toyota      3   Blue
3  $22,000.00          11179     BMW      5  Black
4   $3,500.00         213095  Nissan      4  White
5   $4,500.00          99213  Toyota      4  Green
6   $7,500.00          45698   Honda      4   Blue
7   $7,000.00          54738   Honda      4   Blue
8   $6,250.00          60000  Toyota      4  White
9   $9,700.00          31600  Nissan      4  White

In [32]:
# sorting by values 
car_sales.sort_values(by='Make')

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
1   Honda    Red          87899      4   $5,000.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
4  Nissan  White         213095      4   $3,500.00
9  Nissan  White          31600      4   $9,700.00
0  Toyota  White         150043      4   $4,000.00
2  Toyota   Blue          32549      3   $7,000.00
5  Toyota  Green          99213      4   $4,500.00
8  Toyota  White          60000      4   $6,250.00

# Viewing and Selecting Data

In [34]:
#getting data
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [35]:
car_sales[0:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [36]:
car_sales[3:]

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [37]:
car_sales[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [42]:
car_sales.loc[5]

Make                Toyota
Colour               Green
Odometer (KM)        99213
Doors                    4
Price            $4,500.00
Name: 5, dtype: object

In [43]:
# .loc and .iloc
animals = pd.Series(["cat","dog","snake","lion"])
animals

0      cat
1      dog
2    snake
3     lion
dtype: object

In [46]:
# we can also define self index for this seriies liek this 
animals = pd.Series(["cat","dog","snake","lion","tiger"],[0,3,6,9,3])
animals

0      cat
3      dog
6    snake
9     lion
3    tiger
dtype: object

In [47]:
animals.loc[3]

3      dog
3    tiger
dtype: object

In [48]:
# iloc refers to the position while loc print all value of that
animals.iloc[3]

'lion'

In [49]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [50]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [52]:
# slicing (list) 
animals.iloc[:2]

0    cat
3    dog
dtype: object

In [53]:
animals.iloc[1:]

3      dog
6    snake
9     lion
3    tiger
dtype: object

In [54]:
 car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [55]:
 car_sales[car_sales["Make"] == "Honda"]

    Make Colour  Odometer (KM)  Doors      Price
1  Honda    Red          87899      4  $5,000.00
6  Honda   Blue          45698      4  $7,500.00
7  Honda   Blue          54738      4  $7,000.00

In [65]:
car_sales[car_sales["Odometer (KM)"] > 70000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
4  Nissan  White         213095      4  $3,500.00
5  Toyota  Green          99213      4  $4,500.00

In [66]:
# no results because the price datatype is not integer , its an object
car_sales[car_sales["Price"] == 5000]

Empty DataFrame
Columns: [Make, Colour, Odometer (KM), Doors, Price]
Index: []

## Selecting and viewing data part 2

In [ ]:
Crosstab
groupby

In [67]:
#aggregating one column with another
pd.crosstab(car_sales["Make"] , car_sales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [68]:
# try another exmample on base of price
pd.crosstab(car_sales["Make"] , car_sales["Price"])

Price,"$22,000.00","$3,500.00","$4,000.00","$4,500.00","$5,000.00","$6,250.00","$7,000.00","$7,500.00","$9,700.00"
Make,,,,,,,,,
BMW,1,0,0,0,0,0,0,0,0
Honda,0,0,0,0,1,0,1,1,0
Nissan,0,1,0,0,0,0,0,0,1
Toyota,0,0,1,1,0,1,1,0,0

In [71]:
pd.crosstab(car_sales["Doors"] , car_sales["Colour"])

Colour  Black  Blue  Green  Red  White
Doors
3           0     1      0    0      0
4           0     2      1    1      4
5           1     0      0    0      0

In [72]:
#Groupby
car_sales.groupby(["Make"]).mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75